OFcase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// probe locations
x1 0;
x2 25;
//x3 45;
x3 10;
y1 0.01;
y2 0.4;

application     simpleFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         120;//198;

deltaT          0.0075; // Co~0.75

writeControl    timeStep;

writeInterval   4000;

purgeWrite      2;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // #includeFunc yPlus
    #includeFunc components(U)
    #includeFunc residuals(p,U,k,omega)
    #includeFunc wallShearStress
    probes
    {
        type probes;
        functionObjectLibs ("libsampling.so");
        enabled true;
	//        writeControl timeStep;
        //writeInterval 1;
        probeLocations
        (
            ( $x1 $y1 0 )
	    ( $x1 $y2 0 )
            ( $x2 $y1 0 )
	    ( $x2 $y2 0 )
	    ( $x3 $y1 0 )
	    ( $x3 $y2 0 )
        );
        fields
        (
            p U
        );
     }
  //    #includeFunc writeCellCentres -time 0
}// end of function

// ************************************************************************* //
