OFcase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*	\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "yTopParams.in"

convertToMeters 1;
Lx 25;
Ly 2;
middle #calc "0.5*$Ly";

Nx 2500;

vertices
(
    //0
    (0 0 0)
    //1
    ($Lx 0 0)
    //2
    (0 $middle 0)
    //3
    ($Lx $middle 0)
    //4
    (0 $Ly 0)
    //5
    ($Lx $theta1 0)

    //6
    (0 0 1)
    //7
    ($Lx 0 1)
    //8
    (0 $middle 1)
    //9
    ($Lx $middle 1)
    //10
    (0 $Ly 1)
    //11
    ($Lx $theta1 1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) ($Nx 119 1)
    simpleGrading
    (
     1
     (
      //  % y-dir, % cells, expansion
      (0.0003 10 1) // dy=0.00003
      (0.3997 89 952) //dy 

      (0.6 20 1) // dy=0.03
     )
     1
    )
    
    hex (2 3 5 4 8 9 11 10) ($Nx 119 1)
    simpleGrading
    (
     1
     (
      (0.6 20 1)   
      (0.3997 89 0.0010504201680672268)
      (0.0003 10 1)
     )
     1
    )
);

edges
(
 //    arc 4 5 (2 1.5 0)
 //  arc 10 11 (2 1.5 2)
);

boundary
(
    Wall
    {
        type            wall;
        faces           (
			 (0 1 7 6)
			 (4 10 11 5)
			 );
    }

    frontAndBack
    {
        type            empty;
        faces           (
			 (0 2 3 1)
			 (6 7 9 8)
			 (2 4 5 3)
			 (8 9 11 10)
			 );
    }
    
    outlet
    {
        type            outlet;
        faces           (
			 (1 3 9 7)
			 (3 5 11 9)
			 );
    }

    inlet_low
    {
        type            inlet;
        faces           (
			 (0 6 8 2)
			 );
    }
    inlet_up
    {
        type            inlet;
        faces           (
			 (2 8 10 4)
			 );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
